<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest stable KeePassXC for arm64 and imports it in into Munki.</string>
		<key>Identifier</key>
		<string>com.github.dataJAR-recipes.munki.KeePassXC</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/KeePassXC</string>
			<key>MUNKI_CATEGORY</key>
			<string>Utilities</string>
			<key>NAME</key>
			<string>KeePassXC</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>description</key>
				<string>KeePassXC can store your passwords safely and auto-type them into your everyday websites and applications.

				This is the latest stable version of KeePassXC</string>
				<key>developer</key>
				<string>%NAME%</string>
				<key>display_name</key>
				<string>%NAME% - arm64</string>
				<key>installable_condition</key>
				<string>arch BEGINSWITH "arm"</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>supported_architectures</key>
				<array>
					<string>arm64</string>
				</array>
				<key>unattended_install</key>
				<true/>
				<key>unattended_uninstall</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.4</string>
		<key>ParentRecipe</key>
		<string>com.github.dataJAR-recipes.download.KeePassXC</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>items_to_copy</key>
						<array>
							<dict>
								<key>destination_path</key>
								<string>/Applications</string>
								<key>source_item</key>
								<string>KeePassXC.app</string>
							</dict>
						</array>
						<key>version</key>
						<string>%version%</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
